import classes from './ListOfProgramsNames.module.css';

const listPrograms = [
    {
    name: 'Beautiful and perky 1.0',
    id: 1,
    trainings: [
        {
        number: 1,
        type: 'Top day', 
        difficultyLevel: [1,2,3,4,5],
        id: 1,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
        {
        number: 2,
        type: 'Cardio', 
        difficultyLevel: [1,2,3,4,5],
        id: 2,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
    {
        number: 3,
        type: 'Cardio', 
        difficultyLevel: [1,2,3,4,5],
        id: 3,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
]
    
},
{
    name: 'Beautiful and perky 2.0',
    id: 2,
    trainings: [
        {
        number: 1,
        type: 'Top day', 
        difficultyLevel: [1,2,3,4,5],
        id: 4,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
        {
        number: 2,
        type: 'Cardio', 
        difficultyLevel: [1,2,3,4,5],
        id: 5,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
    {
        number: 3,
        type: 'Cardio', 
        difficultyLevel: [1,2,3,4,5],
        id: 6,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
]
    
},
{
    name: 'Perfect Booty 3.0',
    id: 3,
    trainings: [
        {
        number: 1,
        type: 'Interval', 
        difficultyLevel: [1,2,3,4,5],
        id: 8,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
        {
        number: 7,
        type: 'Cardio', 
        difficultyLevel: [1,2,3,4,5],
        id: 5,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
    {
        number: 9,
        type: 'Full body', 
        difficultyLevel: [1,2,3,4,5],
        id: 6,
        exercise: [['Верхняя тяга к грузи узким хватом', 15], ['Отжимание с широкой постановкой рук с упором в колени',15],
        ['Жим гантелей сидя',20], ['Кувшинчики сидя в наклоне', 25], ['Разгибания рук в раме стоя', 15] ],
        description: 'Каждый супер-сет,то есть подряд два упражнения без отдыха, необходимо выполнить по 2-3 раза. Отдых между упражнениями в супер-сете отсутствует, отдых между супер-сетами до 2 минут.',
        totalTime: '1h30',
    },
]
    
},
]
// const list = [
//     {
//     weekday: 'Monday',
//     type: 'Leg day', 
//     difficultyLevel: [1,2,3,4,5],
//     id: 1 
//     },
//     {
//     weekday: 'Tuesday',
//     type: 'Top day', 
//     difficultyLevel: [1,2,3,4,5],
//     id: 2  
//     },
//     {
//     weekday: 'Wednesday',
//     type: 'Cardio', 
//     difficultyLevel: [1,2,3,4,5],
//     id: 3    
//     },
//     {
//     weekday: 'Thursday',
//     type: 'Full body', 
//     difficultyLevel: [1,2,3,4,5],
//     id: 4    
//     },
//     {
//     weekday: 'Friday',
//     type: 'Interval', 
//     difficultyLevel: [1,2,3,4,5],
//     id: 5    
//     }
// ]

const ListOfProgramsNames = () => {

    return (
        <div>
            {listPrograms.map(program => <p>{program.name}</p>)}
        </div>
    )

}